; domain
(define (domain default)
  (:requirements :strips :typing :conditional-effects)  ; Specifies the requirements: STRIPS, ADL, and typing.
  (:types
    agent workstation warehouse box supply - locatable  ; Object supply_types.
    location supply_type carrier - object
    capacity - object
  )
  (:predicates
    (adjacent ?l1 ?l2 - location)       ; Indicates that ?l1 is adjacent to ?l2.
    (at ?o - locatable ?l - location)  ; Indicates that object ?o is at location ?l.
    (empty ?b - box)   ; Indicates that ?b, a box, is empty.
    (free_arms ?a - agent) ; Indicates that agent ?a has free arms (not carrying a box).
    (box_carried_by ?b - box ?a - agent) ; Indicates that ?b, a box, is being carried by ?a, an agent.
    (contains ?b - box ?s - supply) ; Indicates that ?b, a box, contains ?s, a supply.
    (is ?s - supply ?t - supply_type) ; Indicates the supply_type ?t of a supply ?s.
    (has ?ws - workstation ?t - supply_type) ; Indicates that workstation ?ws requires a supply of supply_type ?t.
    (loaded_to ?s - supply ?ws - workstation) ; Indicates that supply ?s has been loaded to workstation ?ws.
    (unloaded_box ?b - box ?ws - workstation)
    (attached ?c - carrier ?a - agent) ; A carrier is attached to an agent.
    (on ?c - carrier ?b - box) ; A box is on a carrier.
      ;; capacity
    (carrier_capacity ?c - carrier ?cap - capacity)
    (predecessor ?cap0 - capacity ?cap1 - capacity)
  )
  
  ;; Actions
  (:action move
    :parameters (?a - agent ?from ?to - location)
    :precondition (and 
      (adjacent ?from ?to)  ; Requires ?from to be adjacent to ?to.
      (at ?a ?from)  ; Agent ?a must be at the ?from location.
    )
    :effect (and 
      (at ?a ?to)  ; Agent ?a is now at ?to location.
      (not (at ?a ?from))  ; Agent ?a is no longer at ?from location.
    )
  )
  
  (:action take_box
    :parameters (?a - agent ?b - box ?c - carrier ?l - location ?c0 ?c1 - capacity)
    :precondition (and 
      (at ?a ?l)  ; Agent ?a must be at ?l location.
      (at ?b ?l)  ; Box ?b must be at ?l location.
      (attached ?c ?a)  ; The carrier must be attached to the agent.
      (predecessor ?c0 ?c1)
      (carrier_capacity ?c ?c1)
    )
    :effect (and 
      (not (at ?b ?l))  ; Box ?b is no longer at ?l location.
      (box_carried_by ?b ?a)  ; Box ?b is now carried by agent ?a.
      (carrier_capacity ?c ?c0)
      (not (carrier_capacity ?c ?c1))  
      (on ?c ?b)
    )
  )
  
  (:action fill_box
    :parameters (?a - agent ?b - box ?s - supply ?l - location)
    :precondition (and 
      (at ?a ?l)  ; Agent ?a must be at ?l location.
      (at ?s ?l)  ; Supply ?s must be at ?l location.
      (empty ?b)  ; Box ?b must be empty.
      (box_carried_by ?b ?a)
    )
    :effect (and 
      (not (empty ?b))  ; Box ?b is no longer empty.
      (contains ?b ?s)  ; Box ?b now contains supply ?s.
      (not (at ?s ?l))  ; Supply ?s is no longer at ?l location.
    )
  )

  (:action deliver_box
    :parameters (?a - agent ?b - box ?c - carrier ?ws - workstation ?l - location ?c0 ?c1 - capacity)
    :precondition (and 
      (box_carried_by ?b ?a)  ; Box ?b must be carried by agent ?a.
      (at ?a ?l)  ; Agent ?a must be at ?l location.
      (at ?ws ?l)
      (attached ?c ?a)  ; The carrier must be attached to the agent.
      (on ?c ?b)  ; The box must be on the carrier.
      (predecessor ?c0 ?c1)
      (carrier_capacity ?c ?c0)
    )
    :effect (and 
      (not (box_carried_by ?b ?a))  ; Box ?b is no longer carried by agent ?a.
      (not (on ?c ?b))
      (unloaded_box ?b ?ws)
      (carrier_capacity ?c ?c1)
      (not (carrier_capacity ?c ?c0))    
    )
  )
    
  (:action deliver_supply
    :parameters (?a - agent ?ws - workstation ?t - supply_type ?s - supply ?b - box ?l - location )
    :precondition (and 
      (at ?a ?l)  ; Agent ?a must be at ?l location.
      (at ?ws ?l)  ; Workstation ?ws must be at ?l location.
      (is ?s ?t)  ; Supply ?s must be of supply_type ?t.
      (unloaded_box ?b ?ws)
      (contains ?b ?s)  ; Box ?b must contain supply ?s.
    )
    :effect (and 
      (loaded_to ?s ?ws)  ; Supply ?s is now loaded to workstation ?ws.
      (not (contains ?b ?s))  ; Box ?b no longer contains supply ?s.
      (not (unloaded_box ?b ?ws))
      (empty ?b)  ; Box ?b is now empty.
      (at ?b ?l)
      (has ?ws ?t)  ; Workstation ?ws now has a supply of supply_type ?t.
    )
  )
)

; problem
;; problem file: problem_1.pddl
(define (problem default)
  (:domain default)
  (:objects l4_4 l4_6 l6_1 l6_0 l6_2 l6_6 l2_1 l4_0 l5_5 l5_3 l6_4 l3_6 l5_0 l2_6 l4_2 l4_1 l2_2 l5_2 l5_6 l2_4 l2_5 l4_5 l2_3 l5_4 l3_5 l6_5 l6_3 l5_1 l4_3 l3_4 - location agent_1 agent_2 agent_0 - agent supply_7 supply_4 supply_2 supply_3 supply_5 supply_0 supply_1 supply_6 - supply box_1 box_2 box_4 box_5 box_3 box_0 - box workstation_0 workstation_1 - workstation warehouse_0 - warehouse carrier_0 carrier_2 carrier_1 - carrier tool circuit bolt valve - supply_type capacity_0 capacity_3 capacity_2 capacity_1 - capacity )
  (:init (adjacent l6_6 l6_5) (adjacent l4_5 l4_6) (adjacent l5_2 l5_3) (adjacent l3_4 l4_4) (adjacent l4_2 l4_1) (adjacent l5_1 l5_0) (adjacent l5_0 l4_0) (adjacent l4_4 l4_3) (empty box_3) (predecessor capacity_1 capacity_2) (adjacent l2_2 l2_3) (at warehouse_0 l6_1) (adjacent l6_2 l6_1) (adjacent l6_4 l5_4) (is supply_0 valve) (predecessor capacity_0 capacity_1) (at box_1 l6_1) (empty box_0) (adjacent l4_3 l4_4) (adjacent l6_4 l6_5) (adjacent l5_1 l6_1) (adjacent l2_5 l2_6) (adjacent l4_5 l3_5) (adjacent l6_5 l5_5) (adjacent l5_3 l6_3) (at workstation_1 l4_6) (adjacent l5_4 l5_5) (adjacent l4_2 l4_3) (at workstation_0 l5_2) (adjacent l4_1 l4_2) (adjacent l4_2 l5_2) (adjacent l6_2 l6_3) (adjacent l4_1 l5_1) (at agent_2 l6_1) (adjacent l5_3 l5_2) (adjacent l4_4 l5_4) (adjacent l5_2 l5_1) (adjacent l2_4 l2_5) (carrier_capacity carrier_2 capacity_3) (adjacent l5_5 l5_4) (adjacent l3_6 l2_6) (adjacent l5_1 l4_1) (carrier_capacity carrier_1 capacity_3) (adjacent l5_4 l6_4) (adjacent l6_4 l6_3) (is supply_6 circuit) (is supply_2 bolt) (at box_3 l6_1) (adjacent l4_3 l5_3) (empty box_1) (adjacent l5_2 l6_2) (adjacent l2_6 l2_5) (is supply_7 circuit) (adjacent l6_3 l5_3) (adjacent l3_5 l4_5) (at supply_4 l6_1) (adjacent l3_4 l3_5) (adjacent l4_6 l3_6) (attached carrier_2 agent_2) (adjacent l5_6 l5_5) (carrier_capacity carrier_0 capacity_3) (adjacent l5_1 l5_2) (adjacent l6_1 l6_2) (adjacent l5_4 l4_4) (at supply_1 l6_1) (predecessor capacity_2 capacity_3) (at supply_2 l6_1) (adjacent l2_3 l2_2) (attached carrier_0 agent_0) (at box_2 l6_1) (adjacent l2_4 l2_3) (adjacent l4_5 l5_5) (adjacent l5_6 l4_6) (at supply_7 l6_1) (adjacent l5_5 l5_6) (adjacent l2_6 l3_6) (adjacent l5_5 l4_5) (adjacent l4_3 l4_2) (adjacent l4_1 l4_0) (adjacent l4_0 l4_1) (adjacent l6_1 l6_0) (at supply_0 l6_1) (adjacent l6_2 l5_2) (adjacent l5_3 l4_3) (at box_5 l6_1) (adjacent l5_2 l4_2) (adjacent l6_0 l6_1) (adjacent l6_3 l6_4) (adjacent l4_6 l4_5) (at box_4 l6_1) (is supply_5 tool) (adjacent l4_6 l5_6) (adjacent l3_6 l4_6) (adjacent l5_6 l6_6) (adjacent l4_5 l4_4) (is supply_4 tool) (adjacent l6_5 l6_6) (attached carrier_1 agent_1) (adjacent l6_1 l5_1) (adjacent l2_5 l3_5) (adjacent l2_1 l2_2) (empty box_4) (adjacent l3_4 l2_4) (adjacent l5_3 l5_4) (adjacent l2_5 l2_4) (adjacent l4_4 l3_4) (at supply_5 l6_1) (adjacent l2_3 l2_4) (empty box_5) (adjacent l5_4 l5_3) (adjacent l5_0 l6_0) (adjacent l5_0 l5_1) (adjacent l4_0 l5_0) (adjacent l5_5 l6_5) (adjacent l6_5 l6_4) (at box_0 l6_1) (is supply_3 bolt) (empty box_2) (adjacent l2_4 l3_4) (at agent_1 l6_1) (adjacent l2_2 l2_1) (adjacent l6_6 l5_6) (adjacent l3_5 l2_5) (adjacent l6_0 l5_0) (adjacent l3_5 l3_6) (adjacent l3_5 l3_4) (at agent_0 l6_1) (at supply_3 l6_1) (adjacent l3_6 l3_5) (at supply_6 l6_1) (is supply_1 valve) (adjacent l4_4 l4_5) (adjacent l6_3 l6_2))
  (:goal (and (has workstation_1 valve) (has workstation_1 bolt) (has workstation_0 valve) (has workstation_0 tool) (has workstation_0 circuit) (has workstation_1 tool) (has workstation_1 circuit) (has workstation_0 bolt)))
)

; plan
1. (take_box agent_0 box_0 carrier_0 l6_1 capacity_2 capacity_3)
   deleted: (at box_0 l6_1) (carrier_capacity carrier_0 capacity_3)
   added: (box_carried_by box_0 agent_0) (carrier_capacity carrier_0 capacity_2) (on carrier_0 box_0)
   goals met: 0 of 8
2. (move agent_0 l6_1 l6_2)
   deleted: (at agent_0 l6_1)
   added: (at agent_0 l6_2)
   goals met: 0 of 8
3. (move agent_0 l6_2 l6_3)
   deleted: (at agent_0 l6_2)
   added: (at agent_0 l6_3)
   goals met: 0 of 8
4. (move agent_2 l6_1 l6_2)
   deleted: (at agent_2 l6_1)
   added: (at agent_2 l6_2)
   goals met: 0 of 8
5. (move agent_1 l6_1 l6_2)
   deleted: (at agent_1 l6_1)
   added: (at agent_1 l6_2)
   goals met: 0 of 8
6. (move agent_0 l6_3 l5_3)
   deleted: (at agent_0 l6_3)
   added: (at agent_0 l5_3)
   goals met: 0 of 8
7. (move agent_0 l5_3 l5_2)
   deleted: (at agent_0 l5_3)
   added: (at agent_0 l5_2)
   goals met: 0 of 8
8. (move agent_0 l5_2 l6_2)
   deleted: (at agent_0 l5_2)
   added: (at agent_0 l6_2)
   goals met: 0 of 8
9. (move agent_0 l6_2 l6_1)
   deleted: (at agent_0 l6_2)
   added: (at agent_0 l6_1)
   goals met: 0 of 8
10. (fill_box agent_0 box_0 supply_0 l6_1)
   deleted: (empty box_0) (at supply_0 l6_1)
   added: (contains box_0 supply_0)
   goals met: 0 of 8
11. (take_box agent_0 box_3 carrier_0 l6_1 capacity_1 capacity_2)
   deleted: (at box_3 l6_1) (carrier_capacity carrier_0 capacity_2)
   added: (box_carried_by box_3 agent_0) (carrier_capacity carrier_0 capacity_1) (on carrier_0 box_3)
   goals met: 0 of 8
12. (fill_box agent_0 box_3 supply_2 l6_1)
   deleted: (empty box_3) (at supply_2 l6_1)
   added: (contains box_3 supply_2)
   goals met: 0 of 8
13. (move agent_0 l6_1 l6_2)
   deleted: (at agent_0 l6_1)
   added: (at agent_0 l6_2)
   goals met: 0 of 8
14. (move agent_0 l6_2 l5_2)
   deleted: (at agent_0 l6_2)
   added: (at agent_0 l5_2)
   goals met: 0 of 8
15. (deliver_box agent_0 box_3 carrier_0 workstation_0 l5_2 capacity_1 capacity_2)
   deleted: (box_carried_by box_3 agent_0) (on carrier_0 box_3) (carrier_capacity carrier_0 capacity_1)
   added: (unloaded_box box_3 workstation_0) (carrier_capacity carrier_0 capacity_2)
   goals met: 0 of 8
16. (deliver_supply agent_0 workstation_0 bolt supply_2 box_3 l5_2)
   deleted: (contains box_3 supply_2) (unloaded_box box_3 workstation_0)
   added: (loaded_to supply_2 workstation_0) (empty box_3) (at box_3 l5_2) (has workstation_0 bolt)
   goals met: 1 of 8
17. (move agent_0 l5_2 l6_2)
   deleted: (at agent_0 l5_2)
   added: (at agent_0 l6_2)
   goals met: 1 of 8
18. (move agent_0 l6_2 l6_1)
   deleted: (at agent_0 l6_2)
   added: (at agent_0 l6_1)
   goals met: 1 of 8
19. (take_box agent_0 box_5 carrier_0 l6_1 capacity_1 capacity_2)
   deleted: (at box_5 l6_1) (carrier_capacity carrier_0 capacity_2)
   added: (box_carried_by box_5 agent_0) (carrier_capacity carrier_0 capacity_1) (on carrier_0 box_5)
   goals met: 1 of 8
20. (fill_box agent_0 box_5 supply_5 l6_1)
   deleted: (empty box_5) (at supply_5 l6_1)
   added: (contains box_5 supply_5)
   goals met: 1 of 8
21. (move agent_0 l6_1 l6_2)
   deleted: (at agent_0 l6_1)
   added: (at agent_0 l6_2)
   goals met: 1 of 8
22. (move agent_0 l6_2 l5_2)
   deleted: (at agent_0 l6_2)
   added: (at agent_0 l5_2)
   goals met: 1 of 8
23. (deliver_box agent_0 box_5 carrier_0 workstation_0 l5_2 capacity_1 capacity_2)
   deleted: (box_carried_by box_5 agent_0) (on carrier_0 box_5) (carrier_capacity carrier_0 capacity_1)
   added: (unloaded_box box_5 workstation_0) (carrier_capacity carrier_0 capacity_2)
   goals met: 1 of 8
24. (deliver_supply agent_0 workstation_0 tool supply_5 box_5 l5_2)
   deleted: (contains box_5 supply_5) (unloaded_box box_5 workstation_0)
   added: (loaded_to supply_5 workstation_0) (empty box_5) (at box_5 l5_2) (has workstation_0 tool)
   goals met: 2 of 8
25. (move agent_0 l5_2 l6_2)
   deleted: (at agent_0 l5_2)
   added: (at agent_0 l6_2)
   goals met: 2 of 8
26. (move agent_0 l6_2 l6_1)
   deleted: (at agent_0 l6_2)
   added: (at agent_0 l6_1)
   goals met: 2 of 8
27. (take_box agent_0 box_4 carrier_0 l6_1 capacity_1 capacity_2)
   deleted: (at box_4 l6_1) (carrier_capacity carrier_0 capacity_2)
   added: (box_carried_by box_4 agent_0) (carrier_capacity carrier_0 capacity_1) (on carrier_0 box_4)
   goals met: 2 of 8
28. (fill_box agent_0 box_4 supply_6 l6_1)
   deleted: (empty box_4) (at supply_6 l6_1)
   added: (contains box_4 supply_6)
   goals met: 2 of 8
29. (move agent_0 l6_1 l6_2)
   deleted: (at agent_0 l6_1)
   added: (at agent_0 l6_2)
   goals met: 2 of 8
30. (move agent_0 l6_2 l5_2)
   deleted: (at agent_0 l6_2)
   added: (at agent_0 l5_2)
   goals met: 2 of 8
31. (deliver_box agent_0 box_4 carrier_0 workstation_0 l5_2 capacity_1 capacity_2)
   deleted: (box_carried_by box_4 agent_0) (on carrier_0 box_4) (carrier_capacity carrier_0 capacity_1)
   added: (unloaded_box box_4 workstation_0) (carrier_capacity carrier_0 capacity_2)
   goals met: 2 of 8
32. (deliver_supply agent_0 workstation_0 circuit supply_6 box_4 l5_2)
   deleted: (contains box_4 supply_6) (unloaded_box box_4 workstation_0)
   added: (loaded_to supply_6 workstation_0) (empty box_4) (at box_4 l5_2) (has workstation_0 circuit)
   goals met: 3 of 8
33. (deliver_box agent_0 box_0 carrier_0 workstation_0 l5_2 capacity_2 capacity_3)
   deleted: (box_carried_by box_0 agent_0) (on carrier_0 box_0) (carrier_capacity carrier_0 capacity_2)
   added: (unloaded_box box_0 workstation_0) (carrier_capacity carrier_0 capacity_3)
   goals met: 3 of 8
34. (deliver_supply agent_0 workstation_0 valve supply_0 box_0 l5_2)
   deleted: (contains box_0 supply_0) (unloaded_box box_0 workstation_0)
   added: (loaded_to supply_0 workstation_0) (empty box_0) (at box_0 l5_2) (has workstation_0 valve)
   goals met: 4 of 8
35. (take_box agent_0 box_0 carrier_0 l5_2 capacity_2 capacity_3)
   deleted: (at box_0 l5_2) (carrier_capacity carrier_0 capacity_3)
   added: (box_carried_by box_0 agent_0) (carrier_capacity carrier_0 capacity_2) (on carrier_0 box_0)
   goals met: 4 of 8
36. (move agent_0 l5_2 l6_2)
   deleted: (at agent_0 l5_2)
   added: (at agent_0 l6_2)
   goals met: 4 of 8
37. (move agent_0 l6_2 l6_1)
   deleted: (at agent_0 l6_2)
   added: (at agent_0 l6_1)
   goals met: 4 of 8
38. (fill_box agent_0 box_0 supply_1 l6_1)
   deleted: (empty box_0) (at supply_1 l6_1)
   added: (contains box_0 supply_1)
   goals met: 4 of 8
39. (move agent_0 l6_1 l6_2)
   deleted: (at agent_0 l6_1)
   added: (at agent_0 l6_2)
   goals met: 4 of 8
40. (move agent_0 l6_2 l6_3)
   deleted: (at agent_0 l6_2)
   added: (at agent_0 l6_3)
   goals met: 4 of 8
41. (move agent_0 l6_3 l6_4)
   deleted: (at agent_0 l6_3)
   added: (at agent_0 l6_4)
   goals met: 4 of 8
42. (move agent_0 l6_4 l6_5)
   deleted: (at agent_0 l6_4)
   added: (at agent_0 l6_5)
   goals met: 4 of 8
43. (move agent_0 l6_5 l6_6)
   deleted: (at agent_0 l6_5)
   added: (at agent_0 l6_6)
   goals met: 4 of 8
44. (move agent_0 l6_6 l5_6)
   deleted: (at agent_0 l6_6)
   added: (at agent_0 l5_6)
   goals met: 4 of 8
45. (move agent_2 l6_2 l5_2)
   deleted: (at agent_2 l6_2)
   added: (at agent_2 l5_2)
   goals met: 4 of 8
46. (move agent_0 l5_6 l4_6)
   deleted: (at agent_0 l5_6)
   added: (at agent_0 l4_6)
   goals met: 4 of 8
47. (deliver_box agent_0 box_0 carrier_0 workstation_1 l4_6 capacity_2 capacity_3)
   deleted: (box_carried_by box_0 agent_0) (on carrier_0 box_0) (carrier_capacity carrier_0 capacity_2)
   added: (unloaded_box box_0 workstation_1) (carrier_capacity carrier_0 capacity_3)
   goals met: 4 of 8
48. (take_box agent_2 box_3 carrier_2 l5_2 capacity_2 capacity_3)
   deleted: (at box_3 l5_2) (carrier_capacity carrier_2 capacity_3)
   added: (box_carried_by box_3 agent_2) (carrier_capacity carrier_2 capacity_2) (on carrier_2 box_3)
   goals met: 4 of 8
49. (deliver_supply agent_0 workstation_1 valve supply_1 box_0 l4_6)
   deleted: (contains box_0 supply_1) (unloaded_box box_0 workstation_1)
   added: (loaded_to supply_1 workstation_1) (empty box_0) (at box_0 l4_6) (has workstation_1 valve)
   goals met: 5 of 8
50. (move agent_2 l5_2 l6_2)
   deleted: (at agent_2 l5_2)
   added: (at agent_2 l6_2)
   goals met: 5 of 8
51. (move agent_2 l6_2 l6_1)
   deleted: (at agent_2 l6_2)
   added: (at agent_2 l6_1)
   goals met: 5 of 8
52. (fill_box agent_2 box_3 supply_3 l6_1)
   deleted: (empty box_3) (at supply_3 l6_1)
   added: (contains box_3 supply_3)
   goals met: 5 of 8
53. (take_box agent_2 box_2 carrier_2 l6_1 capacity_1 capacity_2)
   deleted: (at box_2 l6_1) (carrier_capacity carrier_2 capacity_2)
   added: (box_carried_by box_2 agent_2) (carrier_capacity carrier_2 capacity_1) (on carrier_2 box_2)
   goals met: 5 of 8
54. (fill_box agent_2 box_2 supply_4 l6_1)
   deleted: (empty box_2) (at supply_4 l6_1)
   added: (contains box_2 supply_4)
   goals met: 5 of 8
55. (take_box agent_2 box_1 carrier_2 l6_1 capacity_0 capacity_1)
   deleted: (at box_1 l6_1) (carrier_capacity carrier_2 capacity_1)
   added: (box_carried_by box_1 agent_2) (carrier_capacity carrier_2 capacity_0) (on carrier_2 box_1)
   goals met: 5 of 8
56. (fill_box agent_2 box_1 supply_7 l6_1)
   deleted: (empty box_1) (at supply_7 l6_1)
   added: (contains box_1 supply_7)
   goals met: 5 of 8
57. (move agent_2 l6_1 l6_2)
   deleted: (at agent_2 l6_1)
   added: (at agent_2 l6_2)
   goals met: 5 of 8
58. (move agent_2 l6_2 l6_3)
   deleted: (at agent_2 l6_2)
   added: (at agent_2 l6_3)
   goals met: 5 of 8
59. (move agent_2 l6_3 l6_4)
   deleted: (at agent_2 l6_3)
   added: (at agent_2 l6_4)
   goals met: 5 of 8
60. (move agent_2 l6_4 l6_5)
   deleted: (at agent_2 l6_4)
   added: (at agent_2 l6_5)
   goals met: 5 of 8
61. (move agent_2 l6_5 l6_6)
   deleted: (at agent_2 l6_5)
   added: (at agent_2 l6_6)
   goals met: 5 of 8
62. (move agent_2 l6_6 l5_6)
   deleted: (at agent_2 l6_6)
   added: (at agent_2 l5_6)
   goals met: 5 of 8
63. (move agent_2 l5_6 l4_6)
   deleted: (at agent_2 l5_6)
   added: (at agent_2 l4_6)
   goals met: 5 of 8
64. (deliver_box agent_2 box_3 carrier_2 workstation_1 l4_6 capacity_0 capacity_1)
   deleted: (box_carried_by box_3 agent_2) (on carrier_2 box_3) (carrier_capacity carrier_2 capacity_0)
   added: (unloaded_box box_3 workstation_1) (carrier_capacity carrier_2 capacity_1)
   goals met: 5 of 8
65. (deliver_box agent_2 box_2 carrier_2 workstation_1 l4_6 capacity_1 capacity_2)
   deleted: (box_carried_by box_2 agent_2) (on carrier_2 box_2) (carrier_capacity carrier_2 capacity_1)
   added: (unloaded_box box_2 workstation_1) (carrier_capacity carrier_2 capacity_2)
   goals met: 5 of 8
66. (deliver_box agent_2 box_1 carrier_2 workstation_1 l4_6 capacity_2 capacity_3)
   deleted: (box_carried_by box_1 agent_2) (on carrier_2 box_1) (carrier_capacity carrier_2 capacity_2)
   added: (unloaded_box box_1 workstation_1) (carrier_capacity carrier_2 capacity_3)
   goals met: 5 of 8
67. (deliver_supply agent_2 workstation_1 bolt supply_3 box_3 l4_6)
   deleted: (contains box_3 supply_3) (unloaded_box box_3 workstation_1)
   added: (loaded_to supply_3 workstation_1) (empty box_3) (at box_3 l4_6) (has workstation_1 bolt)
   goals met: 6 of 8
68. (deliver_supply agent_2 workstation_1 tool supply_4 box_2 l4_6)
   deleted: (contains box_2 supply_4) (unloaded_box box_2 workstation_1)
   added: (loaded_to supply_4 workstation_1) (empty box_2) (at box_2 l4_6) (has workstation_1 tool)
   goals met: 7 of 8
69. (deliver_supply agent_2 workstation_1 circuit supply_7 box_1 l4_6)
   deleted: (contains box_1 supply_7) (unloaded_box box_1 workstation_1)
   added: (loaded_to supply_7 workstation_1) (empty box_1) (at box_1 l4_6) (has workstation_1 circuit)
   goals met: 8 of 8
